#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-hZhnxaLvvJejEC4R

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_security_group.allow_cockpit: Refreshing state... [id=sg-09158a308f058582a]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_launch_template.worker_x86: Refreshing state... [id=lt-02c4ef76cd0a29529]
aws_spot_fleet_request.imagebuilder_worker_x86: Refreshing state... [id=sfr-28456c4c-dc0f-496d-a24c-e13e881d94ba]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_security_group.allow_ssh: Refreshing state... [id=sg-006ce6110566350f2]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.allow_icmp: Refreshing state... [id=sg-08e7ed5aa3caa810e]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_security_group.allow_egress: Refreshing state... [id=sg-01bbbcc6e5692161b]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_instance.composer_internal: Refreshing state... [id=i-0d6d52766e8d4f91d]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-372124328]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-c9d09a9c-c9aa-4089-bbdc-91b6a9746395]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_launch_template.worker_x86 will be destroyed
  - resource "aws_launch_template" "worker_x86" {
      - arn                     = "arn:aws:ec2:us-east-1:933752197999:launch-template/lt-02c4ef76cd0a29529" -> null
      - default_version         = 1 -> null
      - disable_api_termination = false -> null
      - id                      = "lt-02c4ef76cd0a29529" -> null
      - image_id                = "ami-0c82f7789103a1e20" -> null
      - instance_type           = "t3.medium" -> null
      - key_name                = "mhayden" -> null
      - latest_version          = 1 -> null
      - name                    = "imagebuilder_worker_x86_staging" -> null
      - security_group_names    = [] -> null
      - tags                    = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "Image Builder worker - staging"
          - "ServiceOwner" = "Image Builder"
        } -> null
      - update_default_version  = true -> null
      - user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybQpTWVNURU1fSE9TVE5BTUU9d29ya2VyLWZsZWV0LXRlc3RpbmcKCiMgU2V0IHRoZSBob3N0bmFtZSB0byB0aGUgaG9zdG5hbWUgcGFzc2VkIGJ5IHRlcnJhZm9ybS4KaG9zdG5hbWVjdGwgc2V0LWhvc3RuYW1lICRTWVNURU1fSE9TVE5BTUUKCmRuZiAteSBpbnN0YWxsIGNvY2twaXQgY29ja3BpdC1jb21wb3NlciBvc2J1aWxkLWNvbXBvc2VyCnN5c3RlbWN0bCBlbmFibGUgLS1ub3cgY29ja3BpdC5zb2NrZXQKc3lzdGVtY3RsIGVuYWJsZSAtLW5vdyBvc2J1aWxkLWNvbXBvc2VyLnNvY2tldAoK" -> null
      - vpc_security_group_ids  = [
          - "sg-006ce6110566350f2",
          - "sg-01bbbcc6e5692161b",
          - "sg-08e7ed5aa3caa810e",
          - "sg-09158a308f058582a",
        ] -> null

      - block_device_mappings {
          - device_name = "/dev/sda1" -> null

          - ebs {
              - iops        = 0 -> null
              - throughput  = 0 -> null
              - volume_size = 50 -> null
              - volume_type = "gp2" -> null
            }
        }

      - tag_specifications {
          - resource_type = "instance" -> null
          - tags          = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "Image Builder worker - staging"
              - "ServiceOwner" = "Image Builder"
            } -> null
        }
      - tag_specifications {
          - resource_type = "volume" -> null
          - tags          = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "Image Builder worker - staging"
              - "ServiceOwner" = "Image Builder"
            } -> null
        }
    }

  # aws_security_group.allow_cockpit will be destroyed
  - resource "aws_security_group" "allow_cockpit" {
      - arn                    = "arn:aws:ec2:us-east-1:933752197999:security-group/sg-09158a308f058582a" -> null
      - description            = "Allow cockpit access" -> null
      - egress                 = [] -> null
      - id                     = "sg-09158a308f058582a" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/8",
                ]
              - description      = "cockpit"
              - from_port        = 9090
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 9090
            },
        ] -> null
      - name                   = "external_allow_cockpit_staging" -> null
      - owner_id               = "933752197999" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "external_allow_cockpit_staging"
          - "ServiceOwner" = "Image Builder"
        } -> null
      - vpc_id                 = "vpc-78468405" -> null
    }

  # aws_spot_fleet_request.imagebuilder_worker_x86 will be destroyed
  - resource "aws_spot_fleet_request" "imagebuilder_worker_x86" {
      - allocation_strategy                 = "lowestPrice" -> null
      - client_token                        = "terraform-2020120420465727990000000d" -> null
      - excess_capacity_termination_policy  = "Default" -> null
      - fleet_type                          = "maintain" -> null
      - iam_fleet_role                      = "arn:aws:iam::933752197999:role/imagebuilder_spot_fleet_role_staging" -> null
      - id                                  = "sfr-28456c4c-dc0f-496d-a24c-e13e881d94ba" -> null
      - instance_interruption_behaviour     = "terminate" -> null
      - instance_pools_to_use_count         = 1 -> null
      - load_balancers                      = [] -> null
      - replace_unhealthy_instances         = false -> null
      - spot_request_state                  = "active" -> null
      - tags                                = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "Image Builder worker fleet - staging"
          - "ServiceOwner" = "Image Builder"
        } -> null
      - target_capacity                     = 0 -> null
      - target_group_arns                   = [] -> null
      - terminate_instances_with_expiration = true -> null
      - wait_for_fulfillment                = false -> null

      - launch_template_config {
          - launch_template_specification {
              - id      = "lt-02c4ef76cd0a29529" -> null
              - version = "1" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
    }

  # aws_vpc_endpoint.external_vpc_cloudwatch_logs will be created
  + resource "aws_vpc_endpoint" "external_vpc_cloudwatch_logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder CloudWatch Logs VPC endpoint"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-78468405"
    }

  # aws_vpc_endpoint.internal_vpc_cloudwatch_logs will be created
  + resource "aws_vpc_endpoint" "internal_vpc_cloudwatch_logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder CloudWatch Logs VPC endpoint"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-06d6127910664367d"
    }

Plan: 2 to add, 0 to change, 3 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*